public class zadanie1 {
    //1. Где хранятся переменные? Сколько переменных можно задать в программе? Чем ограничен размер?
    public static void main (String[] args) {
        System.out.println("Ответ на Задание 1: Переменные хранятся в условных ячейках памяти, которые, в свою очередь, хранятся в области памяти, называемой \"стэк\". Программист может задавать неограниченное число переменных. Размер переменных ограничивается кратностью. В зависимости от операционной системы переменная должна быть кратна либо 8-ми, либо 16-ти байтам.");
    }
}